Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_rtc.h
/**
  * @brief    Clear RTC Second Interrupt Flag
  * @rmtoll   ISR    SEC_IF    FL_RTC_ClearFlag_Second
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_ClearFlag_Second(RTC_Type* RTCx)
{
    WRITE_REG(RTCx->ISR, RTC_ISR_SEC_IF_Msk);
}

/**
  * @brief    Get RTC Second Interrupt Flag
  * @rmtoll   ISR    SEC_IF    FL_RTC_IsActiveFlag_Second
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsActiveFlag_Second(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ISR, RTC_ISR_SEC_IF_Msk) == (RTC_ISR_SEC_IF_Msk));
}

/**
  * @brief    Clear RTC Minute Interrupt Flag
  * @rmtoll   ISR    MIN_IF    FL_RTC_ClearFlag_Minute
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_ClearFlag_Minute(RTC_Type* RTCx)
{
    WRITE_REG(RTCx->ISR, RTC_ISR_MIN_IF_Msk);
}

/**
  * @brief    Get RTC Minute Interrupt Flag
  * @rmtoll   ISR    MIN_IF    FL_RTC_IsActiveFlag_Minute
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsActiveFlag_Minute(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ISR, RTC_ISR_MIN_IF_Msk) == (RTC_ISR_MIN_IF_Msk));
}

/**
  * @brief    Clear RTC Hour Interrupt Flag
  * @rmtoll   ISR    HOUR_IF    FL_RTC_ClearFlag_Hour
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_ClearFlag_Hour(RTC_Type* RTCx)
{
    WRITE_REG(RTCx->ISR, RTC_ISR_HOUR_IF_Msk);
}

/**
  * @brief    Get RTC Hour Interrupt Flag
  * @rmtoll   ISR    HOUR_IF    FL_RTC_IsActiveFlag_Hour
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsActiveFlag_Hour(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ISR, RTC_ISR_HOUR_IF_Msk) == (RTC_ISR_HOUR_IF_Msk));
}

/**
  * @brief    Clear RTC Day Interrupt Flag
  * @rmtoll   ISR    DAY_IF    FL_RTC_ClearFlag_Day
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_ClearFlag_Day(RTC_Type* RTCx)
{
    WRITE_REG(RTCx->ISR, RTC_ISR_DAY_IF_Msk);
}

/**
  * @brief    Get RTC Day Interrupt Flag
  * @rmtoll   ISR    DAY_IF    FL_RTC_IsActiveFlag_Day
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsActiveFlag_Day(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ISR, RTC_ISR_DAY_IF_Msk) == (RTC_ISR_DAY_IF_Msk));
}

/**
  * @brief    Get RTC Second Value
  * @rmtoll   BCDSEC        FL_RTC_ReadSecond
  * @param    RTCx RTC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_RTC_ReadSecond(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->BCDSEC, (0x7fU << 0U)) >> 0U);
}

/**
  * @brief    Set RTC Second Value
  * @rmtoll   BCDSEC        FL_RTC_WriteSecond
  * @param    RTCx RTC instance
  * @param    second 
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_WriteSecond(RTC_Type* RTCx, uint32_t second)
{
    MODIFY_REG(RTCx->BCDSEC, (0x7fU << 0U), (second << 0U));
}

/**
  * @brief    Get RTC Minute Value
  * @rmtoll   BCDMIN        FL_RTC_ReadMinute
  * @param    RTCx RTC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_RTC_ReadMinute(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->BCDMIN, (0x7fU << 0U)) >> 0U);
}

/**
  * @brief    Set RTC Minute Value
  * @rmtoll   BCDMIN        FL_RTC_WriteMinute
  * @param    RTCx RTC instance
  * @param    minute 
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_WriteMinute(RTC_Type* RTCx, uint32_t minute)
{
    MODIFY_REG(RTCx->BCDMIN, (0x7fU << 0U), (minute << 0U));
}

/**
  * @brief    Get RTC Hour Value
  * @rmtoll   BCDHOUR        FL_RTC_ReadHour
  * @param    RTCx RTC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_RTC_ReadHour(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->BCDHOUR, (0x3fU << 0U)) >> 0U);
}

/**
  * @brief    Set RTC Hour Value
  * @rmtoll   BCDHOUR        FL_RTC_WriteHour
  * @param    RTCx RTC instance
  * @param    hour 
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_WriteHour(RTC_Type* RTCx, uint32_t hour)
{
    MODIFY_REG(RTCx->BCDHOUR, (0x3fU << 0U), (hour << 0U));
}

/**
  * @brief    Get RTC Day Value
  * @rmtoll   BCDDAY        FL_RTC_ReadDay
  * @param    RTCx RTC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_RTC_ReadDay(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->BCDDAY, (0x3fU << 0U)) >> 0U);
}

/**
  * @brief    Set RTC Day Value
  * @rmtoll   BCDDAY        FL_RTC_WriteDay
  * @param    RTCx RTC instance
  * @param    day 
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_WriteDay(RTC_Type* RTCx, uint32_t day)
{
    MODIFY_REG(RTCx->BCDDAY, (0x3fU << 0U), (day << 0U));
}

/**
  * @brief    Get RTC Week Value
  * @rmtoll   BCDWEEK        FL_RTC_ReadWeek
  * @param    RTCx RTC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_RTC_ReadWeek(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->BCDWEEK, (0x7U << 0U)) >> 0U);
}

/**
  * @brief    Set RTC Week Value
  * @rmtoll   BCDWEEK        FL_RTC_WriteWeek
  * @param    RTCx RTC instance
  * @param    week 
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_WriteWeek(RTC_Type* RTCx, uint32_t week)
{
    MODIFY_REG(RTCx->BCDWEEK, (0x7U << 0U), (week << 0U));
}

/**
  * @brief    Get RTC Month Value
  * @rmtoll   BCDMONTH        FL_RTC_ReadMonth
  * @param    RTCx RTC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_RTC_ReadMonth(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->BCDMONTH, (0x1fU << 0U)) >> 0U);
}

/**
  * @brief    Set RTC Month Value
  * @rmtoll   BCDMONTH        FL_RTC_WriteMonth
  * @param    RTCx RTC instance
  * @param    month 
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_WriteMonth(RTC_Type* RTCx, uint32_t month)
{
    MODIFY_REG(RTCx->BCDMONTH, (0x1fU << 0U), (month << 0U));
}

/**
  * @brief    Get RTC Year Value
  * @rmtoll   BCDYEAR        FL_RTC_ReadYear
  * @param    RTCx RTC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_RTC_ReadYear(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->BCDYEAR, (0xffU << 0U)) >> 0U);
}

/**
  * @brief    Set RTC Year Value
  * @rmtoll   BCDYEAR        FL_RTC_WriteYear
  * @param    RTCx RTC instance
  * @param    year 
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_WriteYear(RTC_Type* RTCx, uint32_t year)
{
    MODIFY_REG(RTCx->BCDYEAR, (0xffU << 0U), (year << 0U));
}

/**
  * @brief    Get RTC Alarm Hour Value
  * @rmtoll   ALARM        FL_RTC_ReadHourAlarm
  * @param    RTCx RTC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_RTC_ReadHourAlarm(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ALARM, (0x3fU << 16U)) >> 16U);
}

/**
  * @brief    Set RTC Alarm Hour Value
  * @rmtoll   ALARM        FL_RTC_WriteHourAlarm
  * @param    RTCx RTC instance
  * @param    hour 
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_WriteHourAlarm(RTC_Type* RTCx, uint32_t hour)
{
    MODIFY_REG(RTCx->ALARM, (0x3fU << 16U), (hour << 16U));
}

/**
  * @brief    Get RTC Alarm Minute Value
  * @rmtoll   ALARM        FL_RTC_ReadMinuteAlarm
  * @param    RTCx RTC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_RTC_ReadMinuteAlarm(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ALARM, (0x7fU << 8U)) >> 8U);
}

/**
  * @brief    Set RTC Alarm Minute Value
  * @rmtoll   ALARM        FL_RTC_WriteMinuteAlarm
  * @param    RTCx RTC instance
  * @param    minute 
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_WriteMinuteAlarm(RTC_Type* RTCx, uint32_t minute)
{
    MODIFY_REG(RTCx->ALARM, (0x7fU << 8U), (minute << 8U));
}

/**
  * @brief    Get RTC Alarm Second Value
  * @rmtoll   ALARM        FL_RTC_ReadSecondAlarm
  * @param    RTCx RTC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_RTC_ReadSecondAlarm(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ALARM, (0x7fU << 0U)) >> 0U);
}

/**
  * @brief    Set RTC Alarm Second Value
  * @rmtoll   ALARM        FL_RTC_WriteSecondAlarm
  * @param    RTCx RTC instance
  * @param    second 
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_WriteSecondAlarm(RTC_Type* RTCx, uint32_t second)
{
    MODIFY_REG(RTCx->ALARM, (0x7fU << 0U), (second << 0U));
}

/**
  * @brief    Set RTC Output Time Mark Signal
  * @rmtoll   TMSEL    TMSEL    FL_RTC_SetTimeMarkOutput
  * @param    RTCx RTC instance
  * @param    markSelect This parameter can be one of the following values:
  *           @arg @ref FL_RTC_TIME_MARK_SECOND
  *           @arg @ref FL_RTC_TIME_MARK_MINUTE
  *           @arg @ref FL_RTC_TIME_MARK_HOUR
  *           @arg @ref FL_RTC_TIME_MARK_DAY
  *           @arg @ref FL_RTC_TIME_MARK_ALARM
  *           @arg @ref FL_RTC_TIME_MARK_32_SEC
  *           @arg @ref FL_RTC_TIME_MARK_SECOND_REVERSE
  *           @arg @ref FL_RTC_TIME_MARK_MINUTE_REVERSE
  *           @arg @ref FL_RTC_TIME_MARK_HOUR_REVERSE
  *           @arg @ref FL_RTC_TIME_MARK_DAY_REVERSE
  *           @arg @ref FL_RTC_TIME_MARK_ALARM_REVERSE
  *           @arg @ref FL_RTC_TIME_MARK_SEC
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_SetTimeMarkOutput(RTC_Type* RTCx, uint32_t markSelect)
{
    MODIFY_REG(RTCx->TMSEL, RTC_TMSEL_TMSEL_Msk, markSelect);
}

/**
  * @brief    Get RTC Output Time Mark Signal Setting
  * @rmtoll   TMSEL    TMSEL    FL_RTC_GetTimeMarkOutput
  * @param    RTCx RTC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_RTC_TIME_MARK_SECOND
  *           @arg @ref FL_RTC_TIME_MARK_MINUTE
  *           @arg @ref FL_RTC_TIME_MARK_HOUR
  *           @arg @ref FL_RTC_TIME_MARK_DAY
  *           @arg @ref FL_RTC_TIME_MARK_ALARM
  *           @arg @ref FL_RTC_TIME_MARK_32_SEC
  *           @arg @ref FL_RTC_TIME_MARK_SECOND_REVERSE
  *           @arg @ref FL_RTC_TIME_MARK_MINUTE_REVERSE
  *           @arg @ref FL_RTC_TIME_MARK_HOUR_REVERSE
  *           @arg @ref FL_RTC_TIME_MARK_DAY_REVERSE
  *           @arg @ref FL_RTC_TIME_MARK_ALARM_REVERSE
  *           @arg @ref FL_RTC_TIME_MARK_SEC
  */
__STATIC_INLINE uint32_t FL_RTC_GetTimeMarkOutput(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->TMSEL, RTC_TMSEL_TMSEL_Msk));
}

/**
  * @brief    Get RTC Adjust Value
  * @rmtoll   ADJUST        FL_RTC_ReadAdjustValue
  * @param    RTCx RTC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_RTC_ReadAdjustValue(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ADJUST, (0x1ffU << 0U)) >> 0U);
}

/**
  * @brief    Set RTC Adjust Value
  * @rmtoll   ADJUST        FL_RTC_WriteAdjustValue
  * @param    RTCx RTC instance
  * @param    adjustValue 
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_WriteAdjustValue(RTC_Type* RTCx, uint32_t adjustValue)
{
    MODIFY_REG(RTCx->ADJUST, (0x1ffU << 0U), (adjustValue << 0U));
}

/**
  * @brief    Set RTC Adjust Direction
  * @rmtoll   ADJUST    ADSIGN    FL_RTC_SetAdjustDirection
  * @param    RTCx RTC instance
  * @param    adjustDir This parameter can be one of the following values:
  *           @arg @ref FL_RTC_ADJUST_DIR_INCREASE
  *           @arg @ref FL_RTC_ADJUST_DIR_DECREASE
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_SetAdjustDirection(RTC_Type* RTCx, uint32_t adjustDir)
{
    MODIFY_REG(RTCx->ADJUST, RTC_ADJUST_ADSIGN_Msk, adjustDir);
}

/**
  * @brief    Get RTC Adjust Direction
  * @rmtoll   ADJUST    ADSIGN    FL_RTC_GetAdjustDirection
  * @param    RTCx RTC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_RTC_ADJUST_DIR_INCREASE
  *           @arg @ref FL_RTC_ADJUST_DIR_DECREASE
  */
__STATIC_INLINE uint32_t FL_RTC_GetAdjustDirection(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ADJUST, RTC_ADJUST_ADSIGN_Msk));
}

/**
  * @brief    Get RTC MilliSecond Counter Value 
  * @rmtoll   MSECCNT        FL_RTC_ReadMilliSecondCounter
  * @param    RTCx RTC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_RTC_ReadMilliSecondCounter(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->MSECCNT, (0xffU << 0U)) >> 0U);
}

/**
  * @brief    Set RTC MilliSecond Counter Value 
  * @rmtoll   MSECCNT        FL_RTC_WriteMilliSecondCounter
  * @param    RTCx RTC instance
  * @param    milliSecondCount 
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_WriteMilliSecondCounter(RTC_Type* RTCx, uint32_t milliSecondCount)
{
    MODIFY_REG(RTCx->MSECCNT, (0xffU << 0U), (milliSecondCount << 0U));
}

/**
  * @brief    RTC enable
  * @rmtoll   CR    EN    FL_RTC_Enable
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_Enable(RTC_Type* RTCx)
{
    SET_BIT(RTCx->CR, RTC_CR_EN_Msk);
}

/**
  * @brief    Get RTC enable status
  * @rmtoll   CR    EN    FL_RTC_IsEnabled
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsEnabled(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->CR, RTC_CR_EN_Msk) == RTC_CR_EN_Msk);
}

/**
  * @brief    RTC disable
  * @rmtoll   CR    EN    FL_RTC_Disable
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_Disable(RTC_Type* RTCx)
{
    CLEAR_BIT(RTCx->CR, RTC_CR_EN_Msk);
}

/**
  * @}
  */

/** @defgroup RTC_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_RTC_DeInit(RTC_Type *RTCx);
void FL_RTC_StructInit(FL_RTC_InitTypeDef *initStruct);
FL_ErrorStatus FL_RTC_GetTime(RTC_Type *RTCx, FL_RTC_InitTypeDef *initStruct);
FL_ErrorStatus FL_RTC_Init(RTC_Type *RTCx, FL_RTC_InitTypeDef *initStruct);
FL_ErrorStatus FL_RTC_ConfigTime(RTC_Type *RTCx, FL_RTC_InitTypeDef *initStruct);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33HT0XXA_FL_RTC_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2024-01-12*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
